/**********************************************************************************/
#include "lcd.h"
#include "text.h"													   
#include "font.h" 
#include <stdio.h>
/*****************************************************************************
** 函数名称: LCD_DrawSquare
** 功能描述: 绘制5x5像素大小的正方形像素点
** x, y: 起点坐标  
** c,k: 长方形的长、宽
** Color: 长方形的颜色
*****************************************************************************/
void LCD_DrawSquare(u16 x, u16 y, u8 c, u8 k, u16 Color)
{
    u8 i, j;
    for (i = 0; i < c; i++)
    {
        for (j = 0; j <k; j++)
        {
            LCD_DrawPoint(x + i, y + j, Color);
        }
    }
}




